# concat and join

In [ ]:
df5 = make_df('ABC',[1,2])
df6 = make_df('BCD',[1,2])

In [ ]:
pd.concat([df5,df6],join='inner')#열기준으로 조인

# append method

pd. concat ([df1,df2])->df1,과 df2을 합쳐
df1.append(df2) ->df1,df2을 기준으로 합쳐/기존의 것이 변경되지 않는 다.
새 인덱스와 데이터 버퍼를 생성하기 때문에 매우 효율적인 방식이라고 보기는 어렵다

In [ ]:
display(df1.append(df2))

# join / merge 
고성능 인메모리 조인과 병합 연산 ****** important
concat, merge 
관계 대수를 나타나는 게 sql 이다
관계 대수
-	데이터와 데이터의 관계 / 예를 들어 1대 1 , 다 대 다 
-	데이터가 1:1 관계는 데이터 하나에 로우가 있읐대 다른 데이터의 로우와 1대1 대응
-	데이터가 1: 다 관계는 데이터 하나에 여러 개의 로우

1 : 1 join

In [1]:
import pandas as pd

df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                   'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [2]:
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                   'hire_date': [2004, 2008, 2012, 2014]})
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [3]:
df3 = pd.merge(df1,df2) # there is no need of 'on' like SQL
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

# 1 : MANY

In [4]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                   'supervisor': ['Carly', 'Guido', 'Steve']})

display(df3)
display(df4)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [ ]:
display(pd.merge(df3,df4))

many : many

# on keyword

In [ ]:
# 컬럼 이름이었던 것을 인덱스를 설정
#새 설정 후 새 컬럼에 지정해야 한다.
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')

display(df1a)
display(df2a)

In [ ]:
#인덱스가 문자열일 때, 방법은 두가지 임

In [ ]:
#1.right on, left on

In [ ]:
# 2.join은 인덱스 기준이다

df1a

In [ ]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                   'food': ['fish', 'beans', 'bread']},
                  columns=['name', 'food'])

df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                   'drink': ['wine', 'beer']},
                  columns=['name', 'drink'])

display(df6)
display(df7)

In [ ]:
pd.merge(df6,df7)# default is inner join

In [5]:
pd.merge(df6,df7,how='outer') # right join

NameError: name 'df6' is not defined

In [6]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                   'rank': [1, 2, 3, 4]})
df8

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

In [7]:
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                   'rank': [3, 1, 4, 2]})
df9

   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

In [8]:
pd.merge(df8, df9, on='name')# important

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [9]:
pd.merge(df8, df9, on='name', suffixes=["_L", "_R"])#important

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2